def cortez():


#user_input = None

elements = []
while user_input != 0:
    user_input = int(input('Enter number: '))
    elements.append(user_input)
    len(elements)
    print(sum(user_input))
print(elements)

#  Програма запитує введення послідовності цілих невід'ємних чисел, доки не буде введено 0. Як тільки
# буде введено 0 (нуль), програма повинна порахувати та вивести на екран:
# - кількість введених чисел (завершальний 0 не рахується)
# - їхню суму
# - добуток
# - середнє арифметичне (крім завершального числа 0)
# - Визначити значення та порядковий номер найбільшого елемента послідовності. Якщо найбільших елементів є кілька,
# виведіть порядковий номер першого з них. Нумерація елементів починається з 1 (однини)
# - визначити кількість парних та непарних елементів у послідовності
# - Визначити значення другого за величиною елемента в цій послідовності
# - визначте, скільки елементів цієї послідовності дорівнюють її найбільшому елементу

# ПРОВЕРИТЬ ОПЕРАТОРОВ, ТАМ БУДУТ ВСЕ НУЖНЫЕ ЗНАЧЕНИЯ И СДЕЛАТЬ ПО АНАЛОГИИ С 6\7 ЗАДАНИЕМ
